# Taps
tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "nextdns/tap"
tap "sachaos/todoist"
tap "simonw/llm"

# Core utilities
brew "asdf"                   # Multi-language version manager
brew "autoconf-archive"       # Collection of autoconf macros
brew "automake"               # GNU build system generator
brew "awk"                    # Text processing language
brew "bat"                    # Cat with syntax highlighting
brew "bottom"                 # System monitor (htop/gtop alternative)
brew "btop"                   # Resource monitor with modern UI
brew "ccache"                 # Compiler cache for faster rebuilds
brew "cmake"                  # Cross-platform build system
brew "coreutils"              # GNU file/text/shell utilities
brew "csview"                 # CSV viewer for terminal
brew "curl"                   # HTTP client library
brew "diff-so-fancy"          # Human-readable diff formatter
brew "difftastic"             # Syntax-aware diff tool
brew "direnv"                 # Per-directory environment variables
brew "dust"                   # Disk usage analyzer (du alternative)
brew "eza"                    # Modern ls replacement
brew "fastfetch"              # System info display tool
brew "fd"                     # Fast file finder (find alternative)
brew "ffmpeg"                 # Audio/video processing toolkit
brew "fontforge"              # Font editor and converter
brew "fswatch"                # File change monitor
brew "fzf"                    # Fuzzy finder for command line
brew "gawk"                   # GNU awk implementation
brew "gcc"                    # GNU compiler collection
brew "git-delta"              # Git diff pager with syntax highlighting
brew "git-lfs"                # Git large file storage
brew "go"                     # Go programming language
brew "helix"                  # Modal text editor in Rust
brew "htop"                   # Interactive process viewer
brew "hugo"                   # Static site generator
brew "imagemagick"            # Image manipulation toolkit
brew "jdtls"                  # Java language server
brew "jj"                     # Git-compatible VCS
brew "katago"                 # Neural network Go engine
brew "ki"                     # Kotlin interactive shell
brew "lazydocker"             # Terminal UI for Docker
brew "libffi"                 # Foreign function interface library
brew "libgccjit"              # GCC JIT compilation library
brew "libmagic"               # File type detection library
brew "libpq"                  # PostgreSQL C library
brew "librsvg"                # SVG rendering library
brew "libvterm"               # Terminal emulator library
brew "llm"                    # CLI for LLMs
brew "llvm@19"                # LLVM compiler infrastructure
brew "lua"                    # Lightweight scripting language
brew "mbedtls"                # Crypto/SSL/TLS library
brew "mtr"                    # Network diagnostic tool
brew "nasm"                   # x86 assembler
brew "neovim"                 # Modern vim fork
brew "ninja"                  # Build system
brew "openssl@1.1"            # SSL/TLS library (legacy)
brew "p7zip"                  # 7-Zip compression tool
brew "pandoc"                 # Universal document converter
brew "pipx"                   # Python app installer in isolated envs
brew "pkgconf"                # Package config system
brew "powerlevel10k"          # Zsh theme
brew "procs"                  # Modern ps replacement
brew "protolint"              # Protocol Buffer linter
brew "pygments"               # Syntax highlighter
brew "qt"                     # Cross-platform UI framework
brew "rich-cli"               # Terminal formatting tool
brew "sevenzip"               # 7-Zip archiver
brew "shellcheck"             # Shell script linter
brew "shfmt"                  # Shell script formatter
brew "sniffnet"               # Network traffic monitor
brew "starship"               # Cross-shell prompt
brew "stow"                   # Symlink manager for dotfiles
brew "telnet"                 # Remote terminal protocol
brew "texinfo"                # GNU documentation format
brew "tlrc"                   # Simplified man pages
brew "tmux"                   # Terminal multiplexer
brew "tokei"                  # Code line counter
brew "tree"                   # Directory tree viewer
brew "tree-sitter-cli"        # Parser generator for syntax trees
brew "universal-ctags"        # Code tag generator
brew "watch"                  # Execute command periodically
brew "wxwidgets"              # Cross-platform GUI toolkit
brew "yazi"                   # Terminal file manager
brew "yq"                     # YAML/JSON/XML processor
brew "yt-dlp"                 # YouTube video downloader
brew "zoxide"                 # Smart directory jumper

# Development tools
brew "b2-tools"               # Backblaze B2 CLI
brew "bandwhich"              # Terminal bandwidth monitor
brew "boost"                  # C++ library collection
brew "codex"                  # CLI for OpenAI Codex
brew "datasette"              # Data exploration tool
brew "doctl"                  # DigitalOcean CLI
brew "docutils"               # Python documentation utilities

# Tap-specific packages
brew "borkdude/brew/clj-kondo"              # Clojure linter
brew "clojure-lsp/brew/clojure-lsp-native"  # Clojure language server
brew "felixkratz/formulae/borders"          # Window border manager for macOS
brew "hashicorp/tap/terraform"              # Infrastructure as code tool
brew "koekeishiya/formulae/yabai"           # Tiling window manager for macOS
brew "nextdns/tap/nextdns"                  # DNS/53 to DoH proxy
brew "sachaos/todoist/todoist"              # Todoist CLI client
brew "simonw/llm/ttok"                      # Token counter/truncator

# Casks (GUI applications)
cask "aerospace"                   # Tiling window manager
cask "alt-tab"                     # Windows-style alt-tab
cask "amethyst"                    # Tiling window manager
cask "bruno"                       # API testing client
cask "emacs-app"                   # Emacs editor
cask "font-fira-code-nerd-font"    # Nerd font variant
cask "font-hack-nerd-font"         # Nerd font variant
cask "font-maple-mono-nf"          # Maple Mono Nerd Font
cask "font-meslo-lg-nerd-font"     # Nerd font variant
cask "font-victor-mono"            # Victor Mono font
cask "ghostty"                     # GPU-accelerated terminal
cask "orbstack"                    # Docker Desktop alternative
cask "postman"                     # API development platform
cask "raycast"                     # Spotlight replacement
cask "warp"                        # Rust-based terminal
cask "wireshark"                   # Network protocol analyzer
cask "wireshark-app"               # Wireshark GUI application
cask "zen"                         # Zen browser
cask "zen-browser"                 # Privacy-focused browser
