tap "bufbuild/buf"
tap "confluentinc/tap"
tap "d12frosted/emacs-plus"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jimeh/emacs-builds"
tap "nextdns/tap"
tap "ngrok/ngrok"
tap "ptsochantaris/tap"
tap "sachaos/todoist"
tap "simonw/llm"
tap "sst/tap"
tap "yoheimuta/protolint"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Library for manipulating PNG images
brew "libpng"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Text processing scripting language
brew "awk"
# Mozilla CA certificate store
brew "ca-certificates"
# Mozilla CA bundle for Python
brew "certifi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Terminal bandwidth utilization tool
brew "bandwhich"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# HTTP/2 C Library
brew "libnghttp2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# YAML Parser
brew "libyaml"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# Text processing system for reStructuredText
brew "docutils"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Asynchronous event library
brew "libevent"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Cryptographic & SSL/TLS library
brew "mbedtls"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# MP3 player for Linux and UNIX
brew "mpg123"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Generic library support script
brew "libtool"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Integer Set Library for the polyhedral model
brew "isl"
# GNU compiler collection
brew "gcc"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open-source GitLab command-line tool
brew "glab"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Neural Network Go engine with no human-provided knowledge
brew "katago"
# Kotlin Language Interactive Shell
brew "ki"
# Lazier way to manage everything docker
brew "lazydocker"
# Portable Foreign Function Interface library
brew "libffi"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Conversion library
brew "libiconv", link: true
# Implementation of the file(1) command
brew "libmagic"
# Postgres C API library
brew "libpq"
# Library to render SVG files using Cairo
brew "librsvg"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# LLM inference in C/C++
brew "llama.cpp"
# Access large language models from the command-line
brew "llm"
# Next-gen compiler infrastructure
brew "llvm"
# Next-gen compiler infrastructure
brew "llvm@19"
# Powerful, lightweight programming language
brew "lua"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Modern replacement for ps written in Rust
brew "procs"
# Pluggable linter and fixer to enforce Protocol Buffer style and conventions
brew "protolint"
# Generic syntax highlighter
brew "pygments"
# Cross-platform application and UI framework
brew "qt"
# Command-line toolbox for fancy output in the terminal
brew "rich-cli"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Python 2 and 3 compatibility utilities
brew "six"
# Cross-platform application to monitor your network traffic
brew "sniffnet"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Official documentation format of the GNU project
brew "texinfo"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Terraform
brew "hashicorp/tap/terraform"
# NextDNS DNS/53 to DoH Proxy
brew "nextdns/tap/nextdns"
# Todoist CLI client
brew "sachaos/todoist/todoist"
# Count and truncate text based on tokens
brew "simonw/llm/ttok"
# Enable Windows-like alt-tab
cask "alt-tab"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Open source IDE for exploring and testing APIs
cask "bruno"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-victor-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Rust-based terminal
cask "warp"
# Network protocol analyzer
cask "wireshark-app"
# Gecko based web browser
cask "zen"
vscode "2gua.rainbow-brackets"
vscode "a5hk.paper"
vscode "akamud.vscode-theme-onelight"
vscode "anthropic.claude-code"
vscode "betterthantomorrow.calva"
vscode "borkdude.clj-kondo"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "edwinhuish.better-comments-next"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-community-material-theme"
vscode "github.github-vscode-theme"
vscode "ionic.ionic"
vscode "jdinhlife.gruvbox"
vscode "k--kato.intellij-idea-keybindings"
vscode "marlosirapuan.nord-deep"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "rokoroku.vscode-theme-darcula"
vscode "sashaweiss.block-travel"
vscode "subframe7536.custom-ui-style"
vscode "tuttieee.emacs-mcx"
vscode "yoavbls.pretty-ts-errors"
