tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "sachaos/todoist"
brew "autoconf"
brew "gmp"
brew "coreutils"
brew "libyaml"
brew "openssl@3", link: false
brew "asdf"
brew "autojump"
brew "bottom"
brew "broot"
brew "libssh2"
brew "curl"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "htop"
brew "leiningen"
brew "minikube"
brew "mtr"
brew "pgcli"
brew "starship"
brew "tldr"
brew "tmux"
brew "tokei"
brew "vim"
brew "wxwidgets"
brew "sachaos/todoist/todoist"
cask "emacs"
cask "font-hack-nerd-font"
cask "multipass"
cask "wireshark"
